'''
print('Hello, World!')
print('Маша + Петя = Любовь')
print('x = 3 + 4')
print('x =',3+4)
'''
'''
print(type('Hello, World!'))
print(type(3 + 4))
print(type(3/4))
print(type([1,2,5,10,100]))
'''
'''
x = 3
a = ((x**3)**0.5)
b = (x**3)+(3/x)
c = ((4*(x**7)) - (x**5))
d = ((27*(x**4)) + (12*(x**3)) - (5*(x**2)) + 10)**0.5
y = (a/b*c) + (80 * d)
print(y)
'''
'''
x = 3
y = ((3/2)+((16.7*4.32)//10))/(14.5 + (31/12) - ((x**3.4)//10))
print(y)
'''
'''
a = [1,5,'Good','Bad']
b = [9,'Blue', 'Red',11]
print(a[1] + b[3])
print(a[2] + b[2])
print(a[0]*b[0])
print(a[1]**b[3])
print(a+b)
'''
'''
print('Вставьте в текст недостающие слова и буквы')
print(f'Шляпа гриба, покрытая ... кожиц...й, держится на ... ножк... . Снизу шляпка затянута ... плёнкой. Когда её убирешь, откроется нижняя ... сторона шляпк... .')
a = str(input('вставьте недостающее слово '))
b = str(input('вставьте одну букву '))
c = str(input('вставьте недостающее слово '))
d = str(input('вставьте одну букву '))
e = str(input('вставьте недостающее слово '))
f = str(input('вставьте недостающее слово '))
g = str(input('вставьте одну букву '))
print(f'Шляпа гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d} . Снизу шляпка затянута {e} плёнкой. Когда её убирешь, откроется нижняя {f} сторона шляпк{g}.')
'''